o5e/o5e_firmware/o5e/src/FreeScale/mpc5500_defs.inc
#*************************************************************************
#* FILE NAME: mpc5500_defs.inc              COPYRIGHT (c) Freescale 2004 
#*                                                All Rights Reserved     
#* DESCRIPTION:                                                           
#* This file contains prototypes and definitions for the MPC5500 
#*  assembly functions.
#*
#*  Users should make no changes in this file. 
#*  User defines are in mpc5500_usrdefs.inc
#*========================================================================
#* ORIGINAL AUTHOR: G. Jackson           
#* REV      AUTHOR        DATE       DESCRIPTION OF CHANGE                
#* ---   -----------   -----------   ---------------------                  
#* 0.1   G. Jackson     26/Mar/04    Set up assembly definitions     
#* 0.2   G. Jackson     15/Apr/04    Add SRAM address definitions    
#* 0.3   G. Jackson     13/May/04    Removed 20MSB address definitions
#* 1.0   G. Jackson     25/May/04    Changed OPCNT_OFFSET to IP_ADVANCE
#* 1.1   R. Dees        25/May/04    Added more comments
#* 1.2   G. Jackson     30/Jun/04    Added RCHW constants
#* 1.3   C. Baker       19/Jul/06    Added equate for an MFD of 33
#*                                   Changed DPFEN equates from _NO, _BRST
#*                                     and _ANY to _0, _1 and _3
#*                                   Added .if around equate for DPFEN_3
#*                                   Changed IPFEN equates from _NO, _BRST
#*                                     and _ANY to _0, _1 and _3
#*                                   Added .if around equate for IPFEN_3
#*                                   Changed PFLIM equate from _U to _6
#*                                   Added .if around equate for PFLIM_6
#* 1.4   C. Baker       25/Oct/06    Added L1CSR0[CORG] equates
#*                                   Added device specific INT_SRAM_SIZE equates
#*                                   Added CACHE_STACK_BASE_ADDR equate
#*                                   Fixed comments
#*************************************************************************

#*************************************************************
#*************************************************************
# User should not modify any of the definitions below

#************************************************************************
#                            Definitions                                 
#************************************************************************

# Base addresses
    .equ FLASH_BASE_ADDR,       0x00000000
    .equ SRAM_BASE_ADDR,        0x40000000				# INT_SRAM_BASE

	.if _MPC5533_
	.equ INT_SRAM_SIZE,         0x0000C000				# MPC5533 = 48K
	.else
	.if _MPC5561_
	.equ INT_SRAM_SIZE,         0x00030000				# MPC5561 = 192K
	.else
	.if _MPC5566_
	.equ INT_SRAM_SIZE,         0x00020000				# MPC5566 = 128K
	.else
	.equ INT_SRAM_SIZE,         0x00010000				# MPC5534, MPC5553, MPC5554, MPC5565, MPC5567 = 64K
	.endif
	.endif
	.endif

    .equ CACHE_STACK_BASE_ADDR, 0x40040000				# 4k cache used as stack if available
    .equ INT_SRAM_128BYTSEGS,   (INT_SRAM_SIZE >> 7)	# Number of 128 byte segments
    .equ SHDW_BLK_ADDR,         0x00FFF000				# Shadow Block starts at 0xFF_FC00 for 1K size
    .equ BAM_BASE_ADDR,         0x11300000
    .equ EXTMEM1_BASE_ADDR,     0x20000000
    .equ EXTMEM2_BASE_ADDR,     0x3FF80000

    .equ PBRIDGEA_BASE_ADDR,    0xC3F00000
    .equ EXTBUSINT_BASE_ADDR,   0xC3F84000
    .equ SIU_BASE_ADDR,         0xC3F90000
    .equ ETPU_BASE_ADDR,        0xC3FC0000

    .equ PBRIDGEB_BASE_ADDR,    0xFFF00000
    .equ XBAR_BASE_ADDR,        0xFFF04000
    .equ ECSM_BASE_ADDR,        0xFFF40000
    .equ EDMA_BASE_ADDR,        0xFFF44000
    .equ INTC_BASE_ADDR,        0xFFF48000
    .equ EQADC_BASE_ADDR,       0xFFF80000

# Size for defined address spaces
    .equ SIZE_4M,    0x00400000  #   4 MB
    .equ SIZE_1M,    0x00100000  #   1 MB
    .equ SIZE_768K,  0x000C0000  # 768 KB 
    .equ SIZE_512K,  0x00080000  # 512 KB 
    .equ SIZE_256K,  0x00040000  # 256 KB 
    .equ SIZE_64K,   0x00010000  #  64 KB 
    .equ SIZE_4K,    0x00001000  #   4 KB

#*************** Reset Configuration Half Word constants *********
    .equ WDOG_DISABLE, 0x00000000  # Watchdog is default disabled
    .equ WDOG_ENABLE,  0x04000000  # Watchdog is write once enabled
    .equ CS0_32BIT,    0x00000000  # CS0 external data bus is 32-bits
    .equ CS0_16BIT,    0x02000000  # CS0 external data bus is 16-bits
    .equ MPC5500_ID,   0x005A0000  # RCHW boot ID for MPC5500 devices

#*************** Cache initialization constants **************
# Definitions for the L1CSR0 (SPR1010) (L1 Cache control and Status Register 0)
# bit reference: L1CSR0((CWM<<20)|(DPB<<19)|(CLFC<<8)|(CINV<<1)|(CE)) 

# Fields used for L1CSR0 (L1 Cache Control and Status Register 0)
# WAM = Write Access mode = bit [10]
    .equ WAM_ACC_CHECK,    0x0000000  # 0x0
    .equ WAM_ACC_NO_CHECK, 0x0020000  # 0x1
# CWM = Cache Write Mode = bit [11]
    .equ CWM_WRITE,        0x00000000  # 0x0
    .equ CWM_COPYBCK,      0x00100000  # 0x1
# DPB = Disable Push Buffer = bit [12]
    .equ DPB_PUSH,         0x00000000  # 0x0
    .equ DPB_NOPUSH,       0x00080000  # 0x1
# CLFC = Cache Lock Bits Flash Clear = bit [23]
    .equ CLFC_NO_OP,       0x00000000  # 0x0
    .equ CLFC_CLR_OP,      0x00000100  # 0x1
# CORG = Cache Organisation = bit [27]
    .equ CORG_8_WAY,       0x00000000  # 0x0
    .equ CORG_4_WAY,       0x00000010  # 0x1
# CINV = Cache Invalidate = bit [30]
    .equ CINV_NO_OP,       0x00000000  # 0x0
    .equ CINV_INV_OP,      0x00000002  # 0x1
# CE = Cache Enable = bit [31]
    .equ CE_DISABLE,       0x00000000  # 0x0
    .equ CE_ENABLE,        0x00000001  # 0x1


#*************** FMPLL initialization constants **************
# Define the address for the FMPLL registers 
    .equ FMPLL_SYNCRREG, 0xC3F80000
    .equ FMPLL_SYNSRREG, 0xC3F80004
    .equ SIU_ECCRREG,    0xC3F90984
    .equ SIU_SRCRREG,    0xC3F90010

